{
  "description": "Venmo for AI Agents: a full-stack USDC payment platform on Solana that gives AI agents their own wallets, spending controls, and a simple REST API to send and receive money autonomously, while keeping human bank accounts completely invisible to agents through AES-256 encryption and strict domain isolation.",
  "solanaIntegration": "Every user gets a real Solana keypair on registration via @solana/web3.js Keypair.generate(). Private keys are AES-256-CBC encrypted with scrypt-derived keys and stored in the database, never exposed to agents. USDC transfers use SPL Token createTransferInstruction with automatic Associated Token Account creation for recipients who haven't received USDC before. Balance queries hit getOrCreateAssociatedTokenAccount on the devnet USDC mint (4zMMC9srt5Ri5X14GAgXhaHii3GnPAEERYPJgZJDncDU). A devnet SOL airdrop endpoint funds transaction fees for testing. The entire Solana layer runs through @solana/web3.js 1.98 and @solana/spl-token 0.4, with every on-chain operation wrapped in spending limit checks and audit logging before the transaction is signed and broadcast.",
  "problemStatement": "AI agents are becoming autonomous economic actors: booking services, purchasing API calls, paying for cloud compute, and transacting with other agents. But they have zero native payment infrastructure. Today, developers either hardcode their personal credit card into agent configs (a single prompt injection away from disaster) or give agents raw crypto wallets with no spending controls (one compromised agent drains everything). Meanwhile, any system that connects agents to human bank accounts risks exposing routing numbers, account numbers, and PII through the agent's context window. The result: agents cannot participate in the economy without putting their human operators at serious financial risk. AgentPay solves this by giving every agent its own scoped Solana wallet with per-transaction and daily spending limits, while encrypting all human banking data with AES-256 in a layer that agents literally cannot access through any API endpoint. Agents get full economic autonomy. Humans keep full financial safety.",
  "technicalApproach": "Express/TypeScript backend with Prisma ORM and PostgreSQL. Dual authentication system: humans authenticate via JWT tokens with TOTP two-factor (Google Authenticator), while agents authenticate via SHA-256 hashed API keys with an agentpay_ prefix. The middleware auto-detects auth type from the Bearer token format, routing to the correct verification path. Solana integration via @solana/web3.js handles keypair generation on registration, AES-256-CBC encrypted private key storage using scrypt-derived keys, and SPL Token transfers with automatic ATA creation. Human bank account numbers are encrypted with AES-256-CBC using a completely separate encryption key and salt from wallet encryption (defense in depth). A requireHuman middleware enforces that agents cannot access deposit, withdrawal, bank account, or settings endpoints. Real-time notifications via authenticated WebSocket (JWT in query param, 30s heartbeat) plus HMAC-SHA256 signed webhook callbacks. React/Vite/Tailwind frontend deployed on GitHub Pages. Zod schema validation on every endpoint, rate limiting at 60 req/min.",
  "targetAudience": "AI agent developers who run autonomous agents that need to pay for APIs, cloud compute, data feeds, or other agents' services. Today they hardcode personal credit cards or share a single uncontrolled crypto wallet across all their agents. They want each agent to have its own scoped wallet with spending limits they configure, a clean dashboard showing every transaction, and the guarantee that no agent can ever see or touch their bank account details. Secondary audience: the AI agents themselves, who need a dead-simple REST API (register, check balance, send USDC by @username) to participate in the economy without managing raw Solana keypairs or understanding blockchain internals.",
  "businessModel": "Transaction fees on USDC transfers (0.1-0.5% per transaction, waived during hackathon). Premium tier for agent developers: higher spending limits, priority transaction processing, advanced analytics, webhook management, and multi-agent fleet dashboards ($29/month). As the agent economy scales from thousands to millions of autonomous agents, each needing its own payment rail, AgentPay becomes critical infrastructure. The platform is inherently sticky: once agents are configured with AgentPay wallets, spending limits, and webhook integrations, switching costs are high. Long-term revenue scales linearly with agent transaction volume across the entire ecosystem.",
  "competitiveLandscape": "Solana Pay handles merchant point-of-sale but has no concept of agent wallets, spending controls, or dual human/agent authentication. Circle's USDC APIs provide stablecoin infrastructure but require every developer to build their own auth, limits, and dashboard from scratch. Coinbase Commerce targets e-commerce checkout, not autonomous agent-to-agent transfers. Stripe Connect handles marketplace payouts but is fiat-only with no Solana integration and was never designed for non-human actors. No existing solution combines: dual human/agent authentication, TOTP 2FA for humans, scoped API-key wallets for agents, AES-256 encrypted bank isolation from agent access, per-agent spending limits, @username-based transfers, and real-time WebSocket notifications, all settling in USDC on Solana.",
  "futureVision": "Immediate post-hackathon: deploy to Solana mainnet with real USDC, integrate Plaid for verified bank account linking (replacing manual entry), and add multi-signature approval flows for high-value agent transactions. Three months: launch the @agentpay/sdk npm package for one-line agent integration, add escrow smart contracts for conditional payments (agent pays only when a service is verified as delivered), and build agent reputation scores derived from on-chain transaction history. Six months: cross-chain support via Wormhole, fiat on/off ramps through Circle, and an open agent marketplace where agents discover, hire, and pay each other for services. We intend to continue building this full-time as core infrastructure for the autonomous agent economy."
}